configuration/src/Documents/Трудозатраты/Трудозатраты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Трудозатраты</name>
  <registerRecords>AccumulationRegister.ОказанныеУслуги</registerRecords>
  <registerRecords>InformationRegister.Трудозатраты</registerRecords>
  <attributes>
    <name>ITСтруктура</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДеятельности</name>
    <type>
      <types>CatalogRef.ВидыДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Затрата</name>
    <comment>Затраченное время в часах</comment>
    <type>
      <types>DefinedType.Трудозатрата</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзменениеЗапрещено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>CatalogRef.НаправленияРазработки</types>
    </type>
  </attributes>
  <attributes>
    <name>Объект</name>
    <type>
      <types>DefinedType.ОбъектТрудозатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Услуга</name>
    <type>
      <types>CatalogRef.Услуги</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <comment>Филиал пользователя на момент занесения трудозатрат</comment>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеЛицо</name>
    <comment>Юридическое лицо объекта (или родительской заявки)</comment>
    <type>
      <types>CatalogRef.ЮридическиеЛица</types>
    </type>
  </attributes>
</mdclass:Document>

configuration/src/InformationRegisters/СвязьОбъектовСЗаявкамиНаРазработку/СвязьОбъектовСЗаявкамиНаРазработку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвязьОбъектовСЗаявкамиНаРазработку</name>
  <resources>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаНаРазработку</types>
    </type>
  </resources>
  <attributes>
    <name>ОбъектОснование</name>
    <type>
      <types>DocumentRef.ВнутреннееЗадание</types>
      <types>CatalogRef.Проекты</types>
      <types>DocumentRef.Задача</types>
      <types>DocumentRef.ЗаявкаНаРазработку</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef.ВнутреннееЗадание</types>
      <types>CatalogRef.Проекты</types>
      <types>DocumentRef.Задача</types>
      <types>DocumentRef.ЗаявкаНаРазработку</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заявка_Новая</name>
    <type>
      <types>DocumentRef.ЗаявкаНаРазработку</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/БуферСообщений/БуферСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>БуферСообщений</name>
  <comment>Хранит подготовленные к отправке сообщения с разделением по типу канала отправлки (электронная почта, чат и т.п.)</comment>
  <resources>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.Филиалы</types>
      <types>String</types>
      <types>EnumRef.ТипыСлужебногоКанала</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТекстСообщения</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ТемаСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопыток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отправлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСообщения</name>
    <type>
      <types>EnumRef.ТипыСообщенийМессенджера</types>
    </type>
  </attributes>
  <dimensions>
    <name>ДатаДобавления</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СпособОтправки</name>
    <type>
      <types>EnumRef.СпособыОтправкиСообщений</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/Enums/СпособыОтправкиСообщений/СпособыОтправкиСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыОтправкиСообщений</name>
  <enumValues>
    <name>ЭлектроннаяПочта</name>
  </enumValues>
  <enumValues>
    <name>Мессенджер</name>
  </enumValues>
  <enumValues>
    <name>Trello</name>
  </enumValues>
</mdclass:Enum>

configuration/src/Enums/ТипыСлужебногоКанала/ТипыСлужебногоКанала.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСлужебногоКанала</name>
  <enumValues>
    <name>СообщениеОбОшибках</name>
  </enumValues>
  <enumValues>
    <name>ТехническаяПроблема</name>
  </enumValues>
</mdclass:Enum>

configuration/src/Enums/ТипыСообщенийМессенджера/ТипыСообщенийМессенджера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСообщенийМессенджера</name>
  <enumValues>
    <name>АктуализацияСрокаСдачиЗадач</name>
  </enumValues>
  <enumValues>
    <name>ВыгрузкаОшибокИзЖурнала</name>
  </enumValues>
  <enumValues>
    <name>НапоминанияОЗанесенииТрудозатрат</name>
  </enumValues>
  <enumValues>
    <name>НезаполненныеУслугиВТрудозатратах</name>
  </enumValues>
  <enumValues>
    <name>ОбновлениеСистемы</name>
  </enumValues>
  <enumValues>
    <name>ОповещениеОНаличииСтопСлов</name>
  </enumValues>
  <enumValues>
    <name>ОповещениеФилиалаТестирования</name>
  </enumValues>
  <enumValues>
    <name>ОтсутствуютДанныеПоПользователю</name>
  </enumValues>
  <enumValues>
    <name>ПроблемаПриОбновленииДатыПубликации</name>
  </enumValues>
  <enumValues>
    <name>ПроблемаСДатойЗапрета</name>
  </enumValues>
  <enumValues>
    <name>РассылкаЗадачиВТестировании</name>
  </enumValues>
  <enumValues>
    <name>РасхождениеКлючевыхИзмеренийТрудозатрат</name>
  </enumValues>
  <enumValues>
    <name>РасхожденияВСправочникеФилиалы</name>
  </enumValues>
</mdclass:Enum>

configuration/src/Documents/ЗаявкаНаРазработку/ЗаявкаНаРазработку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаРазработку</name>
  <basedOn>Catalog.Проекты</basedOn>
  <basedOn>Document.ВнутреннееЗадание</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПроцесса</name>
    <type>
      <types>EnumRef.ВидыПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРодительскогоПроекта</name>
    <type>
      <types>CatalogRef.ВидыПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <comment>Некоторые заявки находятся в статусе &quot;Черновик&quot;. При отключении этого статуса дата документа меняется на текущую. Чтобы не потерять исходную дату создания заявки, она помещается в этот реквизит</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмпортированаИзRedmine</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексируемоеОписание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСистемРазработки</name>
    <comment>Количество систем разработки для заявки</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КороткийНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Куратор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.НазначенияЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>CatalogRef.НаправленияРазработки</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗадачиRedmine</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектОснование</name>
    <type>
      <types>DocumentRef.ВнутреннееЗадание</types>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОграниченныйПросмотр</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеСистем</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Продукт</name>
    <type>
      <types>CatalogRef.Продукты</types>
    </type>
  </attributes>
  <attributes>
    <name>СерьезностьОшибки</name>
    <type>
      <types>CatalogRef.СерьезностьОшибок</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокРеализации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФинальныйСтатус</name>
    <comment>Финальный статус заявки</comment>
    <type>
      <types>CatalogRef.СтатусыОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>Черновик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеЛицо</name>
    <type>
      <types>CatalogRef.ЮридическиеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СистемыРазработки</name>
    <attributes>
      <name>Система</name>
      <type>
        <types>CatalogRef.СистемыУчета</types>
      </type>
    </attributes>
    <attributes>
      <name>ГруппаЗаказчиков</name>
      <type>
        <types>CatalogRef.ГруппыЗаказчиковНаправлений</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

configuration/src/Documents/Трудозатраты/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер ИЛИ ВнешнееСоединение ИЛИ ТолстыйКлиентОбычноеПриложение Тогда

#Область ПрограммныйИнтерфейс

// Создает новый документ трудозатрат и выполняет его проведение
//
// Параметры:
//  ДанныеЗаполнения	 - Структура - структура данных документа, полученная методом НовыеПараметрыЗаполненияТрудозатрат()
// 
// Возвращаемое значение:
//  ДокументСсылка.Трудозатраты - ссылка на созданный документ
//
Функция ДобавитьТрудозатраты(Знач ДанныеЗаполнения) Экспорт
	
	Ссылка = Неопределено;
	
	НовыеТрудозатраты = Документы.Трудозатраты.СоздатьДокумент();
	НовыеТрудозатраты.Заполнить(ДанныеЗаполнения);  
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("ДополнительныеСвойства") 
		 И ТипЗнч(ДанныеЗаполнения.ДополнительныеСвойства) = Тип("Структура") Тогда
		Для Каждого Строка Из ДанныеЗаполнения.ДополнительныеСвойства Цикл
			НовыеТрудозатраты.ДополнительныеСвойства.Вставить(Строка.Ключ, Строка.Значение);
		КонецЦикла;
	КонецЕсли;
	
	Если НовыеТрудозатраты.ПроверитьЗаполнение() Тогда
		НовыеТрудозатраты.Записать(РежимЗаписиДокумента.Проведение);
		
		Если НовыеТрудозатраты.ДополнительныеСвойства.Свойство("Объект") Тогда
			ДанныеЗаполнения.Вставить("Объект", НовыеТрудозатраты.ДополнительныеСвойства.Объект);
		КонецЕсли;
		
		Ссылка = НовыеТрудозатраты.Ссылка;
	КонецЕсли;
	
	Возврат Ссылка;
	
КонецФункции

// Возвращает структуру данных для заполнения документа
// 
// Возвращаемое значение:
//   - Структура
//
Функция НовыеПараметрыЗаполненияТрудозатрат() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Дата");
	Результат.Вставить("Объект");
	Результат.Вставить("Затрата");
	Результат.Вставить("ВидДеятельности");
	Результат.Вставить("Услуга");
	Результат.Вставить("Автор");
	Результат.Вставить("Пользователь");
	Результат.Вставить("Филиал");
	Результат.Вставить("ЮридическоеЛицо");
	Результат.Вставить("ITСтруктура");
	Результат.Вставить("ДополнительныеСвойства");
	Результат.Вставить("Комментарий");
	Результат.Вставить("Направление");
	
	Возврат Результат;
	
КонецФункции

// Проверяет наличие трудозатрат, у которых направление и юридическое лицо не совпадает
// с теми, что указаны в объекте трудозатрат и отправляет сообщение в технический канал группы
//
Процедура ПроверитьРасхождениеКлючевыхИзмеренийТрудозатрат() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	#Область ТекстЗапроса
	"ВЫБРАТЬ
	|	ДокументТрудозатраты.Ссылка КАК Документ,
	|	ДокументТрудозатраты.Объект КАК Объект,
	|	ДокументТрудозатраты.Направление КАК Направление,
	|	ДокументТрудозатраты.ЮридическоеЛицо КАК ЮридическоеЛицо
	|ПОМЕСТИТЬ ОтобранныеДокументы
	|ИЗ
	|	Документ.Трудозатраты КАК ДокументТрудозатраты
	|ГДЕ
	|	ДокументТрудозатраты.Проведен
	|	И ДокументТрудозатраты.Дата >= &ПредполагаемаяДатаЗапретаИзмененияДанных
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаявкаНаРазработку.Ссылка КАК Объект,
	|	ОтобранныеДокументы.Направление КАК НаправлениеТрудозатрат,
	|	ОтобранныеДокументы.ЮридическоеЛицо КАК ЮридическоеЛицоТрудозатрат,
	|	ЗаявкаНаРазработку.Направление КАК НаправлениеОбъекта,
	|	ЗаявкаНаРазработку.ЮридическоеЛицо КАК ЮридическоеЛицоОбъекта,
	|	ЗаявкаНаРазработку.Номер КАК Номер,
	|	ЗаявкаНаРазработку.Наименование КАК Наименование
	|ИЗ
	|	ОтобранныеДокументы КАК ОтобранныеДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаРазработку КАК ЗаявкаНаРазработку
	|		ПО ((ВЫРАЗИТЬ(ОтобранныеДокументы.Объект КАК Документ.ЗаявкаНаРазработку)) = ЗаявкаНаРазработку.Ссылка)
	|ГДЕ
	|	(ОтобранныеДокументы.Направление <> ЗаявкаНаРазработку.Направление
	|			ИЛИ ОтобранныеДокументы.ЮридическоеЛицо <> ЗаявкаНаРазработку.ЮридическоеЛицо)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ЗаявкаНаРазработку.Ссылка,
	|	ОтобранныеДокументы.Направление,
	|	ОтобранныеДокументы.ЮридическоеЛицо,
	|	ЗаявкаНаРазработку.Направление,
	|	ЗаявкаНаРазработку.ЮридическоеЛицо,
	|	ЗаявкаНаРазработку.Номер,
	|	ЗаявкаНаРазработку.Наименование
	|ИЗ
	|	ОтобранныеДокументы КАК ОтобранныеДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СвязьОбъектовСЗаявкамиНаРазработку КАК СвязьОбъектовСЗаявкамиНаРазработку
	|		ПО ((ВЫРАЗИТЬ(ОтобранныеДокументы.Объект КАК Документ.Задача)) = (ВЫРАЗИТЬ(СвязьОбъектовСЗаявкамиНаРазработку.Объект КАК Документ.Задача)))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаРазработку КАК ЗаявкаНаРазработку
	|		ПО (СвязьОбъектовСЗаявкамиНаРазработку.Заявка_Новая = ЗаявкаНаРазработку.Ссылка)
	|ГДЕ
	|	(ОтобранныеДокументы.Направление <> ЗаявкаНаРазработку.Направление
	|			ИЛИ ОтобранныеДокументы.ЮридическоеЛицо <> ЗаявкаНаРазработку.ЮридическоеЛицо)";
	#КонецОбласти
	
	ДатаЗапретаИзмененияДанных = КонецДня(Константы.ДатаЗапретаИзмененияДанных.Получить());
	Запрос.УстановитьПараметр("ПредполагаемаяДатаЗапретаИзмененияДанных", ДатаЗапретаИзмененияДанных);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
		
	ШаблонОбъекта = Символы.ПС + "[%1 %2](%3)" + Символы.ПС;
	ШаблонРазличия = 
	"Различаются *%1*:
	|Заявка - %2
	|Трудозатраты - %3" + Символы.ПС;
	
	СтрокиСообщения = Новый Массив;
	СтрокиСообщения.Добавить(":information_source: *Проверка расхождения направлений и юридических лиц в трудозатратах*");
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтрокаОбъета = СтрШаблон(ШаблонОбъекта, Выборка.Номер, Выборка.Наименование, 
			ОбщегоНазначения.ПолучитьHTTPСсылкуНаОбъект(Выборка.Объект));
		
		СтрокиСообщения.Добавить(СтрокаОбъета);
		
		Если Выборка.НаправлениеОбъекта <> Выборка.НаправлениеТрудозатрат Тогда
			СтрокаРазличия = СтрШаблон(ШаблонРазличия, "направления", Выборка.НаправлениеОбъекта, Выборка.НаправлениеТрудозатрат);
			СтрокиСообщения.Добавить(СтрокаРазличия);
		КонецЕсли;
		
		Если Выборка.ЮридическоеЛицоОбъекта <> Выборка.ЮридическоеЛицоТрудозатрат Тогда
			СтрокаРазличия = СтрШаблон(ШаблонРазличия, "юридические лица", Выборка.ЮридическоеЛицоОбъекта, Выборка.ЮридическоеЛицоТрудозатрат);
			СтрокиСообщения.Добавить(СтрокаРазличия);
		КонецЕсли;
	КонецЦикла;
	
	ТекстСообщения = СтрСоединить(СтрокиСообщения);
	
	РегистрыСведений.БуферСообщений.Добавить(Перечисления.СпособыОтправкиСообщений.Мессенджер, 
		Перечисления.ТипыСлужебногоКанала.СообщениеОбОшибках, ТекстСообщения,, 
		Перечисления.ТипыСообщенийМессенджера.РасхождениеКлючевыхИзмеренийТрудозатрат);
	
КонецПроцедуры

// Выполняет пометку на удаление документа трудозатрат
//
// Параметры:
//  ДокументСсылка	 - ДокументСсылка.Трудозатраты	 - документ, трудозатраты по которому требуется удалить
//
Процедура УдалитьТрудозатраты(Знач ДокументСсылка) Экспорт
	
	Если ЗначениеЗаполнено(ДокументСсылка) И ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.Трудозатраты") Тогда
		ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
		
		Если ДокументОбъект <> Неопределено Тогда
			
			УспешноЗаблокирован = Истина;
			Попытка
				ДокументОбъект.Заблокировать();
			Исключение
				УспешноЗаблокирован = Ложь;
				ЗаписьЖурналаРегистрации("Документ.Трудозатраты.Удаление трудозатрат", УровеньЖурналаРегистрации.Предупреждение,
					Метаданные.Документы.Трудозатраты, ДокументСсылка, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
					
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Трудозатраты заблокированы другим пользователем.");
			КонецПопытки;
			
			Если УспешноЗаблокирован Тогда
				ДокументОбъект.ПометкаУдаления = Истина;
				ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
